using System;


/// <summary>
/// Нам надо создать класс Burger(this),
///     что такое объекты, а что такое классы
///     пропишем доступы к классам
/// Создать свойства:
///     (sause, cabbage, cutlet, bread, 
///     count of cutlet, hot, cost)
/// Создадим действия(рассчитать стоимость по скидке, 
///     вывести состав продукта(ляьбда), 
///     состав продукта с комментарием)
///     /поговорим о параметрах и ключ слове return/out
/// Конструкторы(параметризированность, статики)
/// СТАТИКИ - БОЛЬ ДЛЯ НАЧИНАЮЩИХ
/// Частичные класс - это как вообще?
/// </summary>
namespace OOP
{
    class Program
    {
        static void Main(string[] args)
        {

        }
    }
}
